[
    {
        "title": "The Difference From Honours and Non-Honours, CS vs SWE?",
        "text": "Basically on paper, honours has a lot more requirements and you need to have 120.0 credits instead of 90.0 credits, for the non-honours. I say that if you have no idea what you want to do with your life in your third year, then take the honours and do your EECS4XXX courses. It'll help you explore more topics and can help you decide what you want to do post-grad. If you already have a firm grasp of what you want to do when you graduate and none of the EECS4XXX courses seem to interest you, I wouldn't do the honours. Of course, this is my personal opinion and there a lot more factors that contribute to this decision, so I would advise talking to the co-op department first before jumping the gun on anything. Although, if you do want to participate in Lassonde's co-op / internship program, you do have to be in the honours. Then again, being in their programs is not the only way to find an internship (you can do it by applying outside the school). A lot of factor in - but talk to the necessary people to help you make your decision. It's important to note in comparison to other universities, their 'normal computer science degree' is really our 'honours' degree. I know some people get caught up thinking that being in an honours program is 'special', but really honours is the 'standard degree'. At other schools, their four year standard degree is our honours."
    },
    {
        "title": "Bachelors of Art or Science?",
        "text": "In the art variant you'll take more humanities for your electives, and science variant you'll take more science courses for your electives. Same core courses for both parties. I can't really say which one is better than the other, but if I had to choose I would lean more towards sciences - I am doing a B.Sc after all, so there might be some bias in what I say. The best way I can put this is, if you like arts and humanities, the B.A is for you. If you like science and mathematics, the B.Sc is for you."
    },
    {
        "title": "How Should I Pace Myself?",
        "text": "Take courses as needed. There's no need to rush yourself. I hear this a lot: 'I need to take X, Y, Z, I, J, K courses all in the same semester to catch up!' No, you don't. There is no 'catching up.' Are you in university to get your degree as fast as possible and leave barely knowing the content, or are you in university to actually learn and know what you're doing? In my second year, I was too caught up in this. I wanted to graduate at the same time with my friends - but ultimately taking so many courses at once hurt me a lot more than anything. Pace yourself according to your strengths. If you can only manage four courses in a semester, that's fine. If you can only manage three, two, or even one course, that's fine. And it's important you know this. Don't let yourself get caught up in what other people are doing Alternatively, if you're like me and don't really like learning much through textbooks and lectures and instead by doing, then just get your degree and get out. C's get degrees, am I right?"
    },
    {
        "title": "Worried About Not Graduating \"on Time?\"",
        "text": "Okay, so technically, computer science is a four year program. Given you need 120.0 credits, that's 30.0 credits a year, which is 15.0 credits a semester, which is about five courses a term, considering you take your summers off. If you're in the 90.0 credit program, it's 30.0 credits a year for three years instead of four. You can take summer school to accelerate this. Despite this, there is no 'graduating on time' in my opinion. Sure, computer science is a four year degree, right? So you expect to get it done in four year? I've actually met a lot of people who did their computer science degree in five or six years, and they ended up being a lot happier because of it. Taking your time and knowing you can't handle a standard amount is perfectly fine. Hell, I'll be taking 5-6 years to do my degree because I want to rack up a lot of work experience before I graduate. Though, this is my opinion. My friend actually believes the oppposite; instead to get your degree and just get out because experience is king, not your grades (which I can also get behind) It's like my dad says to me - take your time and be happy. You have the rest of your life ahead of you. Just make sure you don't take 10 years to get your degree - it might not be a race, but you shouldn't need 7-8 years for a four year program. For me, I'm doing the THREE year non-honours degree, and I'm finishing it in FIVE years (3 year degree + 5 internships / 20 months of work experience)"
    },
    {
        "title": "Is York a Good School for Computer Science?",
        "text": "To me, any school is a good school for computer science if they have a good co-op / internship program. If you asked me which is the best school for computer science, I would think that Waterloo is the school for computer science because of how masterful their computer science program is - graduating in five years with ~24 months of experience. How? Because between each of their years (first to second, second to third) they make good use of the summers, whether it's for taking classes or using it for co-op. I used to think that was awful, five straight years of school with no break - but it's not. It's class for about 8 months to a year, then a break for co-op, then back to school. It's a great system they got there, but there's no reason you can't do the same at York. During the summers, just make sure you're using them efficiently whether you decide to find a job or take classes. I do think York is lacking in some departments -- professors can be really shitty and the curriculum in some courses are straight ass / taught like ass. Honestly though, I'm pretty happy with my decision to study here - you make the most out of it. If you do just the bare minimum to get your degree and leave you probably won't have the best time. However, I'm very involved in the community, and I love all the friends I've made and feel such a strong sense of camaraderie here."
    },
    {
        "title": "How Much Math Is in Computer Science?",
        "text": "I asked myself the same thing in high school and when I was a first year student because I was awful at advanced functions and calculus. Truth be told, 'computer science math' is not the same as advanced functions and calculus, and I say this sparingly. I find myself programming more logically than I do mathematically, if that makes sense. In the degree itself, yes you'll have your fair share of math classes (EECS1019, MATH1090, MATH1300, MATH1310, MATH2030) but after they're done, they're done. I haven't found myself using anything I learned in calculus I or calculus II, but discrete mathematics? Definitely. Again, I say this sparingly for lack of better word, but 'computer science math' is really more logical based and less calculations based. If you hate calculus, you just need to truck through it and then you're free."
    }
]
