[
    {
        "title": "EECS1001 - Research Directions in Computing",
        "text": "This course is about some possible research topics in the computer science realm (topics will vary each year). If you particularly like research and want to do it in the future, you will like this course. This is the easiest course you'll take, it's pass or fail, so no grade is received. To pass, you just need to attend class (attendance is checked) and do the assignments, which typically aren't longer than an hour of time. Difficulty 1 / 10."
    },
    {
        "title": "EECS1012 (Intro to Computing, Web) or EECS1015 (Intro to Computing, Python)",
        "text": "EECS1012 and EECS1015 are both introductory programming courses. EECS1012 is web development so you'll be learning HTML, CSS, and JavaScript. In EECS1015, you'll learn Python. Both are relatively easy and if you did any programming before, this will be very easy. Otherwise if you're new to computing science and programming as a whole, it can be challenging depending on how quickly you can learn. I recommend EECS1015 because in my opinion Python is the more valuable language to know, but if you're interested in making websites EECS1012 is a viable option too. This course is definitely on the easier side of the spectrum. Difficulty 5 / 10 if you've never programmed before, otherwise 3 / 10."
    },
    {
        "title": "EECS1019 - Discrete Mathematics for Computer Science",
        "text": "Discrete math is not like your average mathematics such as advanced functions or calculus. This is about math that is related to computer science, and includes topics like logic, Boolean algebra, set theory, graph theory, proofs with induction, and more. I found the first half of this course to be easy, but it definitely ramped up when we started doing proofs, counting principles, and more. This can be a very theory heavy and abstract course, so I recommend not grouping this with other hard courses. Overall difficulty 7 / 10."
    },
    {
        "title": "EECS1022 - Programming for Mobile Computing",
        "text": "A more difficult version of EECS1012. Instead of web development, you'll be making mobile apps using Java and Android Studio. Java is the main 'language' York University teaches in, you'll have another 3-4 courses to take that use Java, so make sure you leave the course being comfortable with it. I found this course to be challenging because I never coded before, so it was a mix of struggling to learn Java as well as struggling to use Android Studio. You can't fall behind in lectures, or you're going to be really swamped. Difficulty 7 / 10 if you've never programmed before (especially if you don't know any OOP languages), 4 / 10 otherwise."
    },
    {
        "title": "MATH1300 - Differential Calculus with Applications",
        "text": "This is calculus I - mainly derivatives with some integrals near the end. If you did well in calculus in high school, you'll find majority of this course content to be similar, with the newer content not being that much more challenging. If you struggled with calculus in high school, you'll most likely struggle here too. Read the textbook; it really helped. Difficulty 6 / 10 if you did poorly in high school calculus, 4 / 10 otherwise."
    },
    {
        "title": "MATH1310 - Integral Calculus with Applications",
        "text": "This is calculus II - which is entirely about integrals. There is an insane ramp in difficulty between calculus I and II, so choose your professor wisely, some are harder than others. I would say this is one of the hardest first year courses, have to pay attention, can't skip lectures, textbook is a must, and don't take this course with EECS1019. Difficulty 9 / 10. Possibly subjective because I hate math."
    },
    {
        "title": "Foundational Science Requirement",
        "text": "You need 6.0 science credits from a list of courses, which typically means taking two biology, two chemistry, one of each, or one physics course (biology and chemistry is 3.0 while physics is 6.0). I went with two chemistries (CHEM1000, CHEM1001) since I did well in it in high school and walked away with two As. Play to your strengths and take what you find easy."
    },
    {
        "title": "Electives",
        "text": "You need 90.0 / 120.0 credits for the regular / honours degree. The computer science, science, and math requirements don't fill it completely, so you'll be taking electives here and there. You can view taking electives in your first year in one of two ways: first year courses are the easiest so it would be a good opportunity to knock off some electives, but on the otherhand since the transition from high school to university can be tough you'd want to settle into the new environment first before overloading on courses. Personally I advise on not taking more than 5 courses a semester."
    }
]
