[
    {
        "title": "EECS1001 - Research Directions in Computing",
        "text": "This course introduces possible research topics in the CS realm through a series of weekly lectures (topics will vary each year). If you like research and want to do it in the future, you'll like this course. This is the easiest course you'll take and it's pass or fail. To pass, you need to attend class (attendance is checked) and do the assignments, which typically aren't longer than an hour. \n\n Difficulty 0 / 10."
    },
    {
        "title": "EECS1012 (Intro to Computing, Web) or EECS1015 (Intro to Computing, Python)",
        "text": "EECS1012 and EECS1015 are both intro programming courses. EECS1012 is web development and you'll be learning HTML, CSS, and JavaScript. In EECS1015, you'll learn Python. \n\n Both are relatively easy, and if you have any prior programming experience this will be very easy. If you're new to CS and programming as a whole, it can be challenging depending on how quickly you can learn. I recommend EECS1015 because I believe it's the most useful language to know (and I prefer backend to frontend), but if you're interested in making websites EECS1012 is viable too. This course is definitely on the easier side. \n\n Difficulty 1 / 10 if you have prior programming experience, otherwise 3 / 10."
    },
    {
        "title": "EECS1019 - Discrete Mathematics for Computer Science",
        "text": "Discrete math is not like your average mathematics like advanced functions or calculus. This is about math that is related to computer science, and includes topics like logic gates, Boolean algebra, set theory, graph theory, proofs with induction, etc. \n\n I found the first half of this course to be easy, but it definitely ramped up when we started doing proofs, counting principles, and more. This can be a very theory heavy and abstract course, so I recommend not grouping this with other hard courses. This is probably the first year course that demanded the most time from me. \n\n Difficulty 7 / 10."
    },
    {
        "title": "EECS1022 - Intro to Object Oriented Programming (Mobile Development)",
        "text": "A more intermediate version of EECS1012/1015. You'll be making mobile apps using Java and Android Studio. Java is the main 'language' York University teaches in and you have another 3-4 Java courses to take, so make sure you leave the course being comfortable with it. \n\n I found this course to be hard because I've never coded before, so it was a mix of struggling to learn Java, Android Studio, and how to code in general. Don't fall behind in lectures, or you're going to be really swamped. \n\n Difficulty 4 / 10 with prior experience, otherwise 6 / 10 (especially if you don't know any OOP languages)."
    },
    {
        "title": "MATH1300 - Differential Calculus with Applications",
        "text": "This is calculus I - mainly derivatives with some integrals near the end. If you did well in calculus in high school, you'll find majority of the course content to be similar, with the newer content not being that much more challenging. If you struggled with calculus in high school, you'll 100% struggle here too. Read the textbook; it really helped. \n\n Difficulty 3 / 10 if you liked calculus in high school, otherwise 5 / 10."
    },
    {
        "title": "MATH1310 - Integral Calculus with Applications",
        "text": "This is calculus II - which is entirely integrals. There is an insane ramp in difficulty between calculus I and II, so choose your professor wisely as some are harder than others. I would say this is one of the hardest first year courses, you have to pay attention, can't skip lectures, textbook is a must, and don't take this course with EECS1019. \n\n Difficulty 8 / 10 (possibly subjective since I'm bad at calculus and had take to retake this course twice)."
    },
    {
        "title": "Foundational Science Requirement",
        "text": "You need 6.0 science credits from a list of courses, which typically means taking two biology, two chemistry, one of each, or one physics course (biology and chemistry is 3.0 while physics is 6.0). I went with two chemistries (CHEM1000, CHEM1001) since I did well in it in high school and walked away with two As. Play to your strengths and take what you find easy. \n\n Biased, but I found chemistry easiest. I've heard biology is a lot of memorization, and physics is a lot of math + calculations."
    },
    {
        "title": "Electives",
        "text": "You need 90.0 / 120.0 credits for the regular / honours degree. \n\n The core subjects (computer science, science, and math requirements) don't fill the credit count completely, so you'll be taking a few electives each year. \n\n You can view taking electives in your first year in one of two ways: first year courses are the easiest so it would be a good opportunity to knock off some electives, but on the otherhand since the transition from high school to university can be tough, you'd want to settle into the new environment before overloading on courses. \n\n Everyone's different, but I advise not taking more than 5 courses a semester. The general advice is not to take electives in a heavy semester, and put them into a lighter one. You can always take 1-2 courses in summer school as well to subsidize, if you choose not to take any during the school year."
    }
]
